УТ.КонтурЗакупки/src/DataProcessors/КонтурЗакупки_РегламентнаяЗагрузкаЗакупок/КонтурЗакупки_РегламентнаяЗагрузкаЗакупок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>КонтурЗакупки_РегламентнаяЗагрузкаЗакупок</name>
</mdclass:DataProcessor>

УТ.КонтурЗакупки/src/Catalogs/КонтурЗакупки_ШаблоныПоиска/КонтурЗакупки_ШаблоныПоиска.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КонтурЗакупки_ШаблоныПоиска</name>
  <attributes>
    <name>Авансирование223</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Авансирование44</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВключатьЗакупкиБезНМЦ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсключаемыеСлова</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КлючевыеСлова</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НачальнаяЦенаДо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НачальнаяЦенаОт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоискПоДокументам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПреимуществаСМП</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособОтбораВсе</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособОтбораДругиеСпособы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособОтбораЗакупкаУЕдинственногоПоставщика</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособОтбораЗапросИлиМониторингЦен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособОтбораЗапросКотировок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособОтбораКонкурс</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособОтбораЭлектронныйАукцион</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипТоргов223ФЗ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипТоргов44ФЗ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипТоргов615ПП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипТорговКоммерческиеИМалые</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочныйПоиск</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапЗавершены</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапОтменены</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапПланируются</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапПодачаЗаявок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапРаботаКомиссии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапТолькоНесостоявшиеся</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДобавленныеИсключенныеЗаказчики</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяВРегламентномЗадании</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДнейДоТекущейДаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВключатьЗагрузкуЗакупок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипТорговКоммерческие</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипТорговМалые</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Отрасли</name>
    <attributes>
      <name>Отрасль</name>
      <type>
        <types>CatalogRef.КонтурЗакупки_Отрасли</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Заказчики</name>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ОГРН</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИНН</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ДействиеСоСтрокой</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Площадки</name>
    <attributes>
      <name>Площадка</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторПлощадки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДействиеСоСтрокой</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Регионы</name>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторРегиона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДействиеСоСтрокой</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОтраслиОбновленные</name>
    <attributes>
      <name>Отрасль</name>
      <type>
        <types>CatalogRef.КонтурЗакупки_ОтраслиОбновленные</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ.КонтурЗакупки/src/DataProcessors/КонтурЗакупки_РегламентнаяЗагрузкаЗакупок/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область ПрограммныйИнтерфейс

// Сведения о внешней обработке.
// 
// Возвращаемое значение:
//  Структура -  Сведения о внешней обработке:
// * Вид - Строка - 
// * Наименование - Строка - 
// * Версия - Строка - 
// * БезопасныйРежим - Булево - 
// * Информация - Строка - Краткая информация по обработке, описание обработки
// * ВерсияБСП - Строка - 
// * Команды - ТаблицаЗначений - :
// ** Представление - Строка - представление команды в пользовательском интерфейсе
// ** Идентификатор - Строка - идентификатор команды;любая строка, уникальная в пределах данной обработки
// ** Использование - Строка - 
// ** ПоказыватьОповещение - Булево - 
// ** Модификатор - Строка - 
Функция СведенияОВнешнейОбработке() Экспорт
	ПараметрыРегистрации = Новый Структура;
	ПараметрыРегистрации.Вставить("Вид", "ДополнительнаяОбработка");
	ПараметрыРегистрации.Вставить("Наименование", НСтр("ru = 'Контур.Закупки: Регламентная загрузка закупок'"));
	ПараметрыРегистрации.Вставить("Версия", "1.0.0.1");
	ПараметрыРегистрации.Вставить("БезопасныйРежим", Ложь);
	ПараметрыРегистрации.Вставить("Информация", НСтр("ru = 'Загрузка закупок по шаблонам'"));
	ПараметрыРегистрации.Вставить("ВерсияБСП", "1.2.1.4");
	ТаблицаКоманд = ПолучитьТаблицуКоманд();
	ДобавитьКоманду(ТаблицаКоманд, НСтр("ru = 'Регламентная загрузка закупок'"), "РегламентнаяЗагрузкаЗакупок",
		"ВызовСерверногоМетода");
	ДобавитьКоманду(ТаблицаКоманд, НСтр("ru = 'Регламентная загрузка избранного'"), "РегламентнаяЗагрузкаИзбранного",
		"ВызовСерверногоМетода");

	ПараметрыРегистрации.Вставить("Команды", ТаблицаКоманд);
	Возврат ПараметрыРегистрации;
КонецФункции

// Выполнить команду.
// 
// Параметры:
//  ИдентификаторКоманды - Строка - Идентификатор команды
//  ПараметрыВыполненияКоманды - Структура - Параметры выполнения команды
Процедура ВыполнитьКоманду(ИдентификаторКоманды, ПараметрыВыполненияКоманды) Экспорт
		// Реализация логики команды
	Если ИдентификаторКоманды = "РегламентнаяЗагрузкаЗакупок" Тогда
		РегламентнаяЗагрузкаЗакупок();
	ИначеЕсли ИдентификаторКоманды = "РегламентнаяЗагрузкаИзбранного" Тогда
		РегламентнаяЗагрузкаИзбранного();
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
#Область СлужебныйПрограммныйИнтерфейс

// Регламентная загрузка закупок.
Процедура РегламентнаяЗагрузкаЗакупок() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтурЗакупки_ШаблоныПоиска.Ссылка КАК ШаблоныПоискаСсылка,
	|	КонтурЗакупки_ШаблоныПоиска.ВключатьЗагрузкуЗакупок КАК ВключатьЗагрузкуЗакупок
	|ИЗ
	|	Справочник.КонтурЗакупки_ШаблоныПоиска КАК КонтурЗакупки_ШаблоныПоиска
	|ГДЕ
	|	НЕ КонтурЗакупки_ШаблоныПоиска.ПометкаУдаления
	|	И КонтурЗакупки_ШаблоныПоиска.ИспользуетсяВРегламентномЗадании";

	Выборка = Запрос.Выполнить().Выбрать();
	ОбработкаПоиска = Обработки.КонтурЗакупки_ПоискЗакупок.Создать();
	Пока Выборка.Следующий() Цикл
		ОбработкаПоиска.КонецПериода = ТекущаяДатаСеанса();
		ОбработкаПоиска.ШаблонПоиска = Выборка.ШаблоныПоискаСсылка;
		ОбработкаПоиска.ЗаполнитьПоискПоШаблону();
			
			// 1-я страница
		ОбработкаПоиска.НайтиЗакупки();

		Если Выборка.ВключатьЗагрузкуЗакупок Тогда
			ОбработкаПоиска.ВыбратьВсеНеЗагруженныеНаСтранице();
			ОбработкаПоиска.ЗагрузитьЗакупкиПоСписку();
		КонецЕсли;
			
			// 2-я страница и далее
		Для Стр = 2 По ОбработкаПоиска.СтраницВсего Цикл
			ОбработкаПоиска.НайтиЗакупки(Стр);

			Если Выборка.ВключатьЗагрузкуЗакупок Тогда
				ОбработкаПоиска.ВыбратьВсеНеЗагруженныеНаСтранице();
				ОбработкаПоиска.ЗагрузитьЗакупкиПоСписку();
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

Процедура РегламентнаяЗагрузкаИзбранного() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтурЗакупки_ШаблоныЗагрузкиИзбранного.Ссылка КАК ШаблоныЗагрузкиИзбранногоСсылка
	|ИЗ
	|	Справочник.КонтурЗакупки_ШаблоныЗагрузкиИзбранного КАК КонтурЗакупки_ШаблоныЗагрузкиИзбранного
	|ГДЕ
	|	НЕ КонтурЗакупки_ШаблоныЗагрузкиИзбранного.ПометкаУдаления
	|	И КонтурЗакупки_ШаблоныЗагрузкиИзбранного.ИспользуетсяВРегламентномЗадании";

	Выборка = Запрос.Выполнить().Выбрать();
	ОбработкаПоиска = Обработки.КонтурЗакупки_ПолучениеИзбранныхЗакупок.Создать();
	Пока Выборка.Следующий() Цикл
		ОбработкаПоиска.КонецПериода = ТекущаяДатаСеанса();
		ОбработкаПоиска.ШаблонЗагрузки = Выборка.ШаблоныЗагрузкиИзбранногоСсылка;
		ОбработкаПоиска.ЗаполнитьПоискПоШаблону();
			
			// 1-я страница
		ОбработкаПоиска.ПолучитьИзбранные();
		ОбработкаПоиска.ВыбратьВсеНеЗагруженныеНаСтранице();
		ОбработкаПоиска.ЗагрузитьЗакупкиПоСписку();
			
			// 2-я страница и далее
		Для Стр = 2 По ОбработкаПоиска.СтраницВсего Цикл
			ОбработкаПоиска.ПолучитьИзбранные(Стр);
			ОбработкаПоиска.ВыбратьВсеНеЗагруженныеНаСтранице();
			ОбработкаПоиска.ЗагрузитьЗакупкиПоСписку();
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры
#КонецОбласти
#Область СлужебныеПроцедурыИФункции

Функция ПолучитьТаблицуКоманд()
	Команды = Новый ТаблицаЗначений;
	Команды.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("ПоказыватьОповещение", Новый ОписаниеТипов("Булево"));
	Команды.Колонки.Добавить("Модификатор", Новый ОписаниеТипов("Строка"));
	Возврат Команды;
КонецФункции

Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь,
	Модификатор = "")
	НоваяКоманда = ТаблицаКоманд.Добавить();
	НоваяКоманда.Представление = Представление;
	НоваяКоманда.Идентификатор = Идентификатор;
	НоваяКоманда.Использование = Использование;
	НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение;
	НоваяКоманда.Модификатор = Модификатор;
КонецПроцедуры
#КонецОбласти
#КонецЕсли
